---
kind: property
id: P:Autodesk.Revit.DB.SpacingRule.Justification
source: html/4f18c1c2-1a66-64cb-42f6-5e50f92b4761.htm
---
# Autodesk.Revit.DB.SpacingRule.Justification Property

The justification of the lines within
the region.

## Syntax (C#)
```csharp
public SpacingRuleJustification Justification { get; set; }
```

## Remarks
This property is only available when
 Layout is equal to FixedDistance,
FixedNumber, MaximumSpacing, or MinimumSpacing.